package nursing.depression.no_stress_no_sad_app;

public class DepressQuestions {
    public String depressQuestion[] = {
            "เบื่อ ไม่สนใจทำอะไร",
            "ไม่สบายใจ ซึมเศร้า ท้อแท้",
            "หลับยาก หรือหลับๆ ตื่นๆ หรือหลับมากไป",
            "เหนื่อยง่าย หรือไม่ค่อยมีแรง",
            "เบื่ออาหาร หรือกินมากเกินไป",
            "รู้สึกไม่ดีกับตัวเอง คิดว่าตัวเองล้มเหลว หรือทำให้ตนเองหรือครอบครัวผิดหวัง",
            "สมาธิไม่ดีเวลาทำอะไร เช่น ดูโทรทัศน์ ฟังวิทยุ หรือทำงานที่ต้องใช้ความตั้งใจ",
            "พูดช้า ทำอะไรช้าลง จนคนอื่นสังเกตเห็นได้ หรือกระสับกระส่ายไม่สามารถอยู่นิ่งได้เหมือนที่เคยเป็น",
            "คิดทำร้ายตนเองหรือคิดว่าถ้าตายไปคงจะดี"
    };
    public String getDepressQuestion(int a) {
        String question = depressQuestion[a];
        return question;
    }
}
