package nursing.depression.no_stress_no_sad_app;

public class StressResults {
    private static String[] stressResultValue = {
            "มีความเครียดเล็กน้อย 0-23 คะแนน",
            "มีความเครียดปานกลาง 24-41 คะแนน",
            "มีความเครียดสูง 42 คะแนนขึ้นไป"
    };
    private static String[] stressResultDescription = {
            "ท่านมีความเครียดอยู่ในระดับน้อยและจะหายไปได้ในระยะเวลาสั้น ๆ \n" +
                    "- เป็นความเครียดที่เกิดขึ้นได้ในชีวิตประจำวัน  \n" +
                    "- โดยท่านยังสามารถปรับตัวกับสถานการณ์ต่าง ๆ ได้อย่างเหมาะสม \n" +
                    "- ความเครียดในระดับนี้ถือว่ามีประโยชน์ในการดำเนินชีวิตประจำวันเป็นแรงจูงใจในที่นำไปสู่ความสำเร็จในชีวิตได้\n",
            "- ท่านมีความเครียดในระดับปานกลาง  ถือว่าอยู่ในเกณฑ์ปกติ  ความเครียดระดับนี้ไม่ก่อให้เกิดอันตรายหรือเป็นผลเสียต่อการดำเนินชีวิต\n" +
                    "- เป็นความเครียดที่เกิดขึ้นได้ในชีวิตประจำวัน  เนื่องจากมีสิ่งคุกคามหรือเหตุการณ์ที่ทำให้เครียด  อาจกำลังรู้สึกวิตกกังวลหรือกลัว \n" +
                    "- ท่านสามารถผ่อนคลายความเครียดด้วยการทำกิจกรรมที่เพิ่มพลัง เช่น ออกกำลังกาย เล่นกีฬา ทำสิ่งที่สนุกสนานเพลิดเพลิน เช่น ฟังเพลง อ่านหนังสือ ทำงานอดิเรก หรือพูดคุยระบายความไม่สบายใจกับผู้ที่ไว้วางใจ\n",
            "- ท่านมีความเครียดในระดับสูง  เป็นระดับที่ท่านได้รับความเดือนร้อนจากการจัดการปัญหาไม่ได้  เช่น  รู้สึกขัดแย้งหรืออยู่ในสถานการณ์ที่แก้ไขลำบาก  กำลังประสบกับเหตุการณ์รอบตัวทำให้วิตกกังวล กลัว รู้สึกขัดแย้ง  กำลังปรับความรู้สึกด้วยความลำบาก เป็นต้น\n" +
                    "- จะส่งผลต่อการใช้ชีวิตประจำวันและการเจ็บป่วย เช่น ความดันโลหิตสูง  เป็นแผลในกระเพาะอาหาร เป็นต้น\n" +
                    "- ท่านสามารถคลายเครียดด้วยวิธีที่ทำได้ง่ายแต่ได้ผลดี คือ  การฝึกหายใจ  คลายเครียด  พูดคุยระบายความเครียดกับผู้ไว้วางใจ  หาสาเหตุหรือปัญหาที่ทำให้เครียดและหาวิธีแก้ไข หากท่านไม่สามารถจัดการคลายเครียดด้วยตนเองได้  แนะนำให้พบแพทย์หรือปรึกษาผู้เชี่ยวชาญ\n"
    };
    public static String getStressResultValue(int a) {
        String value = stressResultValue[a];
        return value;
    }
    public static String getStressResultDescription(int a) {
        String description = stressResultDescription[a];
        return description;
    }
}
